# Pandas
- Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.
- It is powerfull library work on data frames that have 'Relational' or 'labeled' data.
- Its aim aligns with doing real-world data analaysis using python.

### Types of Data Structures:
1. Series: One-dimensional labeled array
2. DataFrame: Two-dimensional labeled data structure (like a table)

### to install pandas
- !pip install pandas

In [25]:
import numpy as np
import pandas as pd

# Series
- Series is a One-Dimensional labeled array capable of holding data of any type(integer, string, float, python object, etc.)
- The axis labels are collectively called index.
- A pandas Series can be created using the constructor:
    - pandas.Series(data, index, dtype)

### Creating Series
1. From a List
 - by default, index value is same as indexing point.
   if assign index value length must same as data.

In [9]:
s = pd.Series()
s

s_lst = pd.Series(data=[1,2,3,4,5,6])
s_lst

s_lst_index= pd.Series([10,20,30,40,50], index=['a','b','c','d','e'])
s_lst_index

a    10
b    20
c    30
d    40
e    50
dtype: int64

2. From a Dictionary
  -if index is not assign, it takes key as index.
  -if index is assign, value assign as index order.

In [15]:
s_dict = pd.Series({
    'a': 12,
    'b':15,
    'c': 45,
    'd': 30
}, index = ['d','c','a','e'])
s_dict

d    30.0
c    45.0
a    12.0
e     NaN
dtype: float64

In [26]:
np.nan

nan

3. From NumPy Array

In [32]:
data=np.array(['a','b','c','d','e'])
s_array = pd.Series(data, index=[101,102,103,104,105])
s_array

101    a
102    b
103    c
104    d
105    e
dtype: object

In [33]:
pd.Series(5,index=range(0,10))

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
9    5
dtype: int64

In [ ]:
# Accessing and Indexing
# - .loc = it use labeled of structures.
# - .iloc= it use default index Value 
#s_array[101]
s_array.iloc[0]

'a'

In [40]:
s_array.loc[101]

'a'

In [41]:
s_dict.loc['a']

np.float64(12.0)

In [44]:
#boolean masking
s_lst_index>=40

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [45]:
#boolean indexing
s_lst_index.loc[s_lst_index>=40]

d    40
e    50
dtype: int64

In [46]:
s_lst_index.loc[['a','e','b']]

a    10
e    50
b    20
dtype: int64

In [47]:
s_lst_index[['a','e','b']]

a    10
e    50
b    20
dtype: int64

# DataFrame
- A DataFrame is a two-dimensional data structure.
- i.e., data is aligned in a tabular format in rows and columns.
- Potentially columns are of different types:
    - size: mutable
    - labeled axes(rows and columns)
    - can perform arithmetic operations on rows and columns wise.
- pandas DataFrame can be created using constructor:
    - pandas.DataFrame(data, index, columns,dtype)

### Creating DataFrames
1. From Dictionary of Lists

In [58]:
data=   [[10,20,30,40,50],['Ram','Hari','Sita','Gita','Rita']]
data

[[10, 20, 30, 40, 50], ['Ram', 'Hari', 'Sita', 'Gita', 'Rita']]

In [93]:
pd. DataFrame(data,columns=[2020,2021,2022,2023,20240],index=['Marks','Name'])

      2020  2021  2022  2023  20240
Marks   NaN   NaN   NaN   NaN   NaN
Name    NaN   NaN   NaN   NaN   NaN

In [60]:
pd.DataFrame([['Ram',10],['hari',20],['shyam',30]],columns=['Name','Id'])

    Name  Id
0    Ram  10
1   hari  20
2  shyam  30

2. Dictionary of List

In [77]:
data={
    'Name' : ['Ram','Shyam','hari','gita'],
    'Age': [20,30,40,50]

}
df= pd.DataFrame(data)
df

    Name  Age
0    Ram   20
1  Shyam   30
2   hari   40
3   gita   50

3. List of Edit

In [68]:
data=[
    {'name': 'bob','Age':22},
    {'name':'ole','Age':23} ,
]
pd.DataFrame(data)

  name  Age
0  bob   22
1  ole   23

In [75]:
pd.DataFrame(
    {
        'Name':pd.Series(['Ram','Shya','hari','gita']),
        'Age': pd.Series([20,30,40,50])
    }
)

   Name  Age
0   Ram   20
1  Shya   30
2  hari   40
3  gita   50

# Accessing and Indexing

In [70]:
type(df)

pandas.core.frame.DataFrame

In [71]:
type(df['Name'])

pandas.core.series.Series

In [76]:
df['Name']

0      Ram
1    Shyam
Name: Name, dtype: object

In [73]:
df[['Age','Name']]

   Age   Name
0   20    Ram
1   30  Shyam

In [83]:
df.iloc[[0,3],[1]]

   Age
0   20
3   50

In [85]:
df.loc[[0,3],['Age','Name']]

   Age  Name
0   20   Ram
3   50  gita

In [86]:
df.iloc[0:2]

    Name  Age
0    Ram   20
1  Shyam   30

In [87]:
df.loc[0:2]

    Name  Age
0    Ram   20
1  Shyam   30
2   hari   40

In [ ]:
# Boolean Indexing - display data having age above 30
df['Age']>30

0    False
1    False
2     True
3     True
Name: Age, dtype: bool

In [104]:
# Correct One of previous question
df[df['Age']>30]

   Name  Age
2  hari   40
3  gita   50

In [105]:
ind= df[df['Age']>30].index
ind

Index([2, 3], dtype='int64')

In [106]:
df.loc[ind]

   Name  Age
2  hari   40
3  gita   50

In [110]:
df

    Name  Age
0    Ram   20
1  Shyam   30
2   hari   40
3   gita   50

In [109]:
print('dimension: ',df.ndim)
print('Shape: ',df.shape)
print('Length: ',len(df))

dimension:  2
Shape:  (4, 2)
Length:  4

# To displat total features names

In [111]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [113]:
df.keys()

Index(['Name', 'Age'], dtype='object')